import random
import time

while True:
    print(f'---------- БЕСЕНИЦА ----------')
    print(f'by Erjo')
    print()
    print(f'Броят опити за отгатване на град е 2-пъти неотворените букви, но не повече от 10 пъти')
    print(f'Отварят се 1-вата и последна буква, както и ако има повтарящие се от тях.')
    print(f'За да е по-интересно ще се състезавате за време.')
    print(f'Ако е изтекло времето, последният огтовор не се зачита (даже и да е верен).')
    print()
    timer = int(input('Колко минути ще се състезавате : ')) * 60
    print()
    start_timer = int(time.perf_counter())
    is_time_break = False
    wins = 0
    loses = 0
    diff = 60
    while True:

        city_list = ['София', 'Пловдив', 'Варна', 'Бургас', 'Русе', 'Стара Загора', 'Плевен', 'Добрич', 'Сливен',
                     'Шумен',
                     'Перник', 'Пазарджик', 'Ямбол', 'Хасково', 'Благоевград', 'Велико Търново', 'Враца', 'Габрово',
                     'Асеновград', 'Видин', 'Казанлък', 'Кърджали', 'Кюстендил', 'Монтана', 'Търговище', 'Димитровград',
                     'Силистра', 'Ловеч', 'Дупница', 'Разград', 'Горна Оряховица', 'Свищов', 'Петрич', 'Смолян',
                     'Сандански', 'Самоков', 'Велинград', 'Севлиево', 'Лом', 'Нова Загора', 'Карлово', 'Айтос', 'Троян',
                     'Ботевград', 'Харманли', 'Пещера', 'Гоце Делчев', 'Свиленград', 'Карнобат', 'Панагюрище', 'Чирпан',
                     'Попово', 'Раковски', 'Радомир', 'Първомай', 'Нови Искър', 'Поморие', 'Несебър', 'Червен бряг',
                     'Козлодуй', 'Ихтиман', 'Нови пазар', 'Берковица', 'Раднево', 'Провадия', 'Разлог', 'Балчик',
                     'Бяла Слатина', 'Каварна', 'Костинброд', 'Банкя', 'Стамболийски', 'Етрополе', 'Кнежа', 'Левски',
                     'Павликени', 'Мездра', 'Елхово', 'Тетевен', 'Луковит', 'Тутракан', 'Трявна', 'Девня', 'Средец',
                     'Омуртаг', 'Сопот', 'Исперих', 'Велики Преслав', 'Бяла', 'Ракитово', 'Гълъбово', 'Кричим',
                     'Лясковец', 'Септември', 'Момчилград', 'Банско', 'Белене', 'Аксаково', 'Белослав', 'Своге',
                     'Дряново', 'Любимец', 'Кубрат', 'Пирдоп', 'Елин Пелин', 'Симитли', 'Сливница', 'Златоград',
                     'Хисаря', 'Дулово', 'Долни чифлик', 'Симеоновград', 'Генерал Тошево', 'Тервел', 'Костенец',
                     'Девин', 'Мадан', 'Стралджа', 'Царево', 'Вършец', 'Твърдица', 'Куклен', 'Бобов дол', 'Котел',
                     'Съединение', 'Елена', 'Оряхово', 'Якоруда', 'Божурище', 'Тополовград', 'Белоградчик', 'Стражица',
                     'Камено', 'Чепеларе', 'Созопол', 'Перущица', 'Суворово', 'Златица', 'Крумовград', 'Долна баня',
                     'Дългопол', 'Ветово', 'Полски Тръмбеш', 'Тръстеник', 'Койнаре', 'Долни Дъбник', 'Славяново',
                     'Годеч', 'Правец', 'Игнатиево', 'Костандово', 'Брацигово', 'Две могили', 'Стрелча', 'Неделино',
                     'Свети Влас', 'Сапарева баня', 'Брезник', 'Смядово', 'Ардино', 'Дебелец', 'Никопол', 'Шивачево',
                     'Белово', 'Цар Калоян', 'Мартен', 'Ивайловград', 'Кресна', 'Върбица', 'Рудозем', 'Вълчедръм',
                     'Приморско', 'Глоджево', 'Летница', 'Мъглиж', 'Искър', 'Шабла', 'Гулянци', 'Долна Митрополия',
                     'Крън', 'Вълчи дол', 'Сливо поле', 'Баня', 'Драгоман', 'Сунгурларе', 'Батак', 'Джебел', 'Завет',
                     'Криводол', 'Мизия', 'Белица', 'Каспичан', 'Кула', 'Николаево', 'Ветрен', 'Гурково', 'Роман',
                     'Калофер', 'Каблешково', 'Априлци', 'Бухово', 'Долна Оряховица', 'Павел баня', 'Ябланица', 'Рила',
                     'Опака', 'Угърчин', 'Златарица', 'Хаджидимово', 'Добринище', 'Обзор', 'Бяла черква', 'Дунавци',
                     'Брегово', 'Трън', 'Садово', 'Килифарево', 'Лъки', 'Малко Търново', 'Доспат', 'Копривщица',
                     'Кочериново', 'Лозница', 'Бяла', 'Борово', 'Черноморец', 'Батановци', 'Пордим', 'Ахелой',
                     'Сухиндол',
                     'Българово', 'Брезово', 'Главиница', 'Каолиново', 'Чипровци', 'Меричлери', 'Земен', 'Плачковци',
                     'Кермен', 'Момин проход', 'Алфатар', 'Грамада', 'Сеново', 'Бойчиновци', 'Антоново', 'Ахтопол',
                     'Бобошево', 'Шипка', 'Болярово', 'Димово', 'Брусарци', 'Китен', 'Клисура', 'Плиска', 'Маджарово',
                     'Мелник']
        random_city = random.randrange(0, len(city_list) + 1)
        city = city_list[random_city - 1]
        len_city = len(city)
        guess = ''
        guess_list = [' ']
        is_bingo = False
        no_bingo = False
        is_stop_breaker = False
        is_joker = False
        first_letter = city.lower()[0]
        last_letter = city[len_city - 1]

        same_letter_count = 0
        for index, same_letter in enumerate(city):
            if index > 0 and first_letter == same_letter:
                same_letter_count += 1
            elif index < len_city - 1 and last_letter == same_letter:
                same_letter_count += 1
            elif same_letter_count == ' ':
                same_letter_count += 1

        total_fails = ((len_city - 2 - same_letter_count) * 2)
        if total_fails > 10:
            total_fails = 10
        guess_list.append(first_letter)
        guess_list.append(last_letter)

        if is_time_break:
            break

        while True:

            len_guest_list = len(guess_list)
            all_txt = ''
            the_city = ''

            for index_of_word, letter_in_word in enumerate(city):
                lower_letter = letter_in_word.lower()

                if index_of_word == 0:  # ----------- Първа буква ----------------
                    all_txt = letter_in_word
                    first_letter = letter_in_word.lower()

                elif index_of_word == len_city - 1:  # ----------- Последна буква ----------------
                    all_txt = letter_in_word

                elif letter_in_word == ' ':  # -------- Ако града е от 2 думи -----------
                    all_txt = letter_in_word

                elif letter_in_word in guess_list or lower_letter in guess_list:  # ----------- Позната буква ---------
                    all_txt = letter_in_word

                elif lower_letter == first_letter or letter_in_word == last_letter:  # Повтарящи се от първа и последна
                    all_txt = letter_in_word

                else:  # ----------- Многоточие м/у буквите ----------------
                    all_txt = '.'
                    is_guess_letter = False

                the_city += all_txt  # ------- Сглобяване на града буква по буква -------------

            if is_bingo:
                break

            if the_city == city:
                is_bingo = True
                break

            if no_bingo:
                if the_city == city:
                    print(f'гр.{city}, Ти успя да го намериш !')
                    wins += 1
                else:
                    print(f'Града който не успия да отгатнеш е >>> гр.{city} <<< мисли малко !!! ')
                    print()
                    loses += 1
                break

            print(f'{the_city},   Оставащи опити : {total_fails} | оставащо време : {diff} сек.  | Вашите опити >> '
                  f'{guess_list[1:len_guest_list]}')

            guess = input('       Познай града или дай буква :')
            new_timer = int(time.perf_counter()) - int(start_timer)
            diff = timer - new_timer

            if diff < 1:
                is_time_break = True
                break

            if guess == 'stop' or guess == 'стоп':
                is_stop_breaker = True
                break

            if guess == city:  # ------------- вярно ли е с града----------
                is_bingo = True
                break

            if guess in guess_list:  # ----------- Повтаряне на дадена буква ----------------
                print('Отворена е вече тази буква !')
                continue

            if guess not in guess_list:  # ---------- ако символа не е ползван до сега го записва ----------
                guess_list.append(guess)
                total_fails -= 1

            if total_fails < 1:
                no_bingo = True

            if guess == 'Джокер':
                wins += 1
                is_joker = True
                break
        # ------------------------------- Какво да изпише при всички случаи --------------
        if is_bingo:
            print(f'гр.{city}, Ти успя да го намериш !')
            wins += 1

        elif is_joker:
            print(f'гр.{city}, Ти успя да го намериш !')

        if is_time_break:
            print('ВРЕМЕТО ИЗТЕЧЕ !!!')
            print(f'Резултата е познати градове >> {wins}  /  непознати градове >> {loses}  за{timer}сек.')
            break

        if is_stop_breaker:
            break

    new_game = input('Нова игра д / н :')
    if new_game == 'н' or new_game == 'н':
        break
